Revit 2027 API
UnitUtils.GetAllDisciplines Method
 Gets the identifiers of all available disciplines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetAllDisciplines()
Public Shared Function GetAllDisciplines As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetAllDisciplines()
static member GetAllDisciplines : unit -> IList<ForgeTypeId>
Return Value
IList<ForgeTypeId>
 The discipline identifiers.
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace